; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-5-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	p0-6 - location
	p1-4 - location
	p1-6 - location
	p2-1 - location
	p2-3 - location
	p3-5 - location
	p4-5 - location
	p4-7 - location
	p5-0 - location
	p5-6 - location
	p7-0 - location
	p7-2 - location
	p7-5 - location
	p7-8 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s1)
	(at driver3 s2)
	(at driver4 s7)
	(at driver5 s4)
	(at truck1 s7)
	(empty truck1)
	(at truck2 s5)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s6)
	(empty truck4)
	(at truck5 s5)
	(empty truck5)
	(at package1 s8)
	(at package2 s6)
	(at package3 s2)
	(at package4 s2)
	(at package5 s5)
	(at package6 s8)
	(at package7 s2)
	(at package8 s2)
	(at package9 s3)
	(at package10 s1)
	(at package11 s1)
	(at package12 s1)
	(at package13 s5)
	(at package14 s0)
	(at package15 s3)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(= (time-to-walk s0 p0-6) 19)
	(= (time-to-walk p0-6 s0) 19)
	(= (time-to-walk s6 p0-6) 4)
	(= (time-to-walk p0-6 s6) 4)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 20)
	(= (time-to-walk p1-4 s1) 20)
	(= (time-to-walk s4 p1-4) 97)
	(= (time-to-walk p1-4 s4) 97)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(= (time-to-walk s1 p1-6) 32)
	(= (time-to-walk p1-6 s1) 32)
	(= (time-to-walk s6 p1-6) 55)
	(= (time-to-walk p1-6 s6) 55)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 30)
	(= (time-to-walk p2-1 s2) 30)
	(= (time-to-walk s1 p2-1) 58)
	(= (time-to-walk p2-1 s1) 58)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 44)
	(= (time-to-walk p2-3 s2) 44)
	(= (time-to-walk s3 p2-3) 39)
	(= (time-to-walk p2-3 s3) 39)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 1)
	(= (time-to-walk p3-5 s3) 1)
	(= (time-to-walk s5 p3-5) 9)
	(= (time-to-walk p3-5 s5) 9)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 83)
	(= (time-to-walk p4-5 s4) 83)
	(= (time-to-walk s5 p4-5) 14)
	(= (time-to-walk p4-5 s5) 14)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(= (time-to-walk s4 p4-7) 40)
	(= (time-to-walk p4-7 s4) 40)
	(= (time-to-walk s7 p4-7) 7)
	(= (time-to-walk p4-7 s7) 7)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 31)
	(= (time-to-walk p5-0 s5) 31)
	(= (time-to-walk s0 p5-0) 63)
	(= (time-to-walk p5-0 s0) 63)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(= (time-to-walk s5 p5-6) 38)
	(= (time-to-walk p5-6 s5) 38)
	(= (time-to-walk s6 p5-6) 51)
	(= (time-to-walk p5-6 s6) 51)
	(path s7 p7-0)
	(path p7-0 s7)
	(path s0 p7-0)
	(path p7-0 s0)
	(= (time-to-walk s7 p7-0) 63)
	(= (time-to-walk p7-0 s7) 63)
	(= (time-to-walk s0 p7-0) 97)
	(= (time-to-walk p7-0 s0) 97)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(= (time-to-walk s7 p7-2) 11)
	(= (time-to-walk p7-2 s7) 11)
	(= (time-to-walk s2 p7-2) 85)
	(= (time-to-walk p7-2 s2) 85)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(= (time-to-walk s7 p7-5) 11)
	(= (time-to-walk p7-5 s7) 11)
	(= (time-to-walk s5 p7-5) 18)
	(= (time-to-walk p7-5 s5) 18)
	(path s7 p7-8)
	(path p7-8 s7)
	(path s8 p7-8)
	(path p7-8 s8)
	(= (time-to-walk s7 p7-8) 38)
	(= (time-to-walk p7-8 s7) 38)
	(= (time-to-walk s8 p7-8) 64)
	(= (time-to-walk p7-8 s8) 64)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 61)
	(= (time-to-drive s4 s0) 61)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 50)
	(= (time-to-drive s7 s0) 50)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 8)
	(= (time-to-drive s2 s1) 8)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 79)
	(= (time-to-drive s6 s1) 79)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 54)
	(= (time-to-drive s5 s2) 54)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 27)
	(= (time-to-drive s0 s3) 27)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 75)
	(= (time-to-drive s4 s3) 75)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 86)
	(= (time-to-drive s5 s4) 86)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 82)
	(= (time-to-drive s6 s4) 82)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 5)
	(= (time-to-drive s8 s4) 5)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 43)
	(= (time-to-drive s0 s5) 43)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 25)
	(= (time-to-drive s1 s5) 25)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 43)
	(= (time-to-drive s7 s5) 43)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 44)
	(= (time-to-drive s3 s6) 44)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 33)
	(= (time-to-drive s5 s6) 33)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 26)
	(= (time-to-drive s3 s7) 26)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 57)
	(= (time-to-drive s4 s7) 57)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 73)
	(= (time-to-drive s8 s7) 73)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 33)
	(= (time-to-drive s0 s8) 33)
	(link s8 s1)
	(link s1 s8)
	(= (time-to-drive s8 s1) 87)
	(= (time-to-drive s1 s8) 87)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 35)
	(= (time-to-drive s2 s8) 35)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s3)
	(at driver5 s3)
	(at truck1 s0)
	(at truck2 s5)
	(at truck4 s3)
	(at package2 s2)
	(at package3 s4)
	(at package4 s3)
	(at package5 s8)
	(at package6 s6)
	(at package7 s3)
	(at package8 s7)
	(at package9 s5)
	(at package10 s2)
	(at package11 s2)
	(at package12 s8)
	(at package13 s1)
	(at package14 s4)
	(at package15 s1)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 2  (driven))) (* 4  (walked))))

)

; plan
1. (board-truck driver4 truck1 s7)
   deleted: (at driver4 s7) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 1 of 20
2. (drive-truck truck1 s7 s8 driver4)
   deleted: (at truck1 s7)
   added: (at truck1 s8)
   changed: (driven) from 0 to 73
   goals met: 1 of 20
3. (drive-truck truck1 s8 s1 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s1)
   changed: (driven) from 73 to 160
   goals met: 1 of 20
4. (load-truck package10 truck1 s1)
   deleted: (at package10 s1)
   added: (in package10 truck1)
   goals met: 1 of 20
5. (load-truck package11 truck1 s1)
   deleted: (at package11 s1)
   added: (in package11 truck1)
   goals met: 1 of 20
6. (load-truck package12 truck1 s1)
   deleted: (at package12 s1)
   added: (in package12 truck1)
   goals met: 1 of 20
7. (drive-truck truck1 s1 s8 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s8)
   changed: (driven) from 160 to 247
   goals met: 1 of 20
8. (unload-truck package12 truck1 s8)
   deleted: (in package12 truck1)
   added: (at package12 s8)
   goals met: 2 of 20
9. (load-truck package6 truck1 s8)
   deleted: (at package6 s8)
   added: (in package6 truck1)
   goals met: 2 of 20
10. (drive-truck truck1 s8 s1 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s1)
   changed: (driven) from 247 to 334
   goals met: 2 of 20
11. (drive-truck truck1 s1 s5 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   changed: (driven) from 334 to 359
   goals met: 2 of 20
12. (load-truck package5 truck1 s5)
   deleted: (at package5 s5)
   added: (in package5 truck1)
   goals met: 2 of 20
13. (load-truck package13 truck1 s5)
   deleted: (at package13 s5)
   added: (in package13 truck1)
   goals met: 2 of 20
14. (drive-truck truck1 s5 s6 driver4)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   changed: (driven) from 359 to 392
   goals met: 2 of 20
15. (unload-truck package6 truck1 s6)
   deleted: (in package6 truck1)
   added: (at package6 s6)
   goals met: 3 of 20
16. (load-truck package2 truck1 s6)
   deleted: (at package2 s6)
   added: (in package2 truck1)
   goals met: 3 of 20
17. (drive-truck truck1 s6 s1 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   changed: (driven) from 392 to 471
   goals met: 3 of 20
18. (unload-truck package13 truck1 s1)
   deleted: (in package13 truck1)
   added: (at package13 s1)
   goals met: 4 of 20
19. (drive-truck truck1 s1 s8 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s8)
   changed: (driven) from 471 to 558
   goals met: 4 of 20
20. (walk driver2 s1 p1-6)
   deleted: (at driver2 s1)
   added: (at driver2 p1-6)
   changed: (walked) from 0 to 32
   goals met: 4 of 20
21. (walk driver2 p1-6 s6)
   deleted: (at driver2 p1-6)
   added: (at driver2 s6)
   changed: (walked) from 32 to 87
   goals met: 4 of 20
22. (board-truck driver2 truck4 s6)
   deleted: (at driver2 s6) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 4 of 20
23. (drive-truck truck4 s6 s3 driver2)
   deleted: (at truck4 s6)
   added: (at truck4 s3)
   changed: (driven) from 558 to 602
   goals met: 5 of 20
24. (disembark-truck driver2 truck4 s3)
   deleted: (driving driver2 truck4)
   added: (at driver2 s3) (empty truck4)
   goals met: 6 of 20
25. (unload-truck package5 truck1 s8)
   deleted: (in package5 truck1)
   added: (at package5 s8)
   goals met: 7 of 20
26. (board-truck driver5 truck3 s4)
   deleted: (at driver5 s4) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 7 of 20
27. (drive-truck truck3 s4 s3 driver5)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   changed: (driven) from 602 to 677
   goals met: 7 of 20
28. (drive-truck truck1 s8 s0 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s0)
   changed: (driven) from 677 to 710
   goals met: 8 of 20
29. (disembark-truck driver5 truck3 s3)
   deleted: (driving driver5 truck3)
   added: (at driver5 s3) (empty truck3)
   goals met: 9 of 20
30. (drive-truck truck1 s0 s7 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   changed: (driven) from 710 to 760
   goals met: 8 of 20
31. (walk driver1 s2 p7-2)
   deleted: (at driver1 s2)
   added: (at driver1 p7-2)
   changed: (walked) from 87 to 172
   goals met: 8 of 20
32. (walk driver1 p7-2 s7)
   deleted: (at driver1 p7-2)
   added: (at driver1 s7)
   changed: (walked) from 172 to 183
   goals met: 8 of 20
33. (walk driver1 s7 p7-0)
   deleted: (at driver1 s7)
   added: (at driver1 p7-0)
   changed: (walked) from 183 to 246
   goals met: 8 of 20
34. (walk driver1 p7-0 s0)
   deleted: (at driver1 p7-0)
   added: (at driver1 s0)
   changed: (walked) from 246 to 343
   goals met: 9 of 20
35. (drive-truck truck1 s7 s0 driver4)
   deleted: (at truck1 s7)
   added: (at truck1 s0)
   changed: (driven) from 760 to 810
   goals met: 10 of 20
36. (load-truck package14 truck1 s0)
   deleted: (at package14 s0)
   added: (in package14 truck1)
   goals met: 10 of 20
37. (drive-truck truck1 s0 s4 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (driven) from 810 to 871
   goals met: 9 of 20
38. (unload-truck package14 truck1 s4)
   deleted: (in package14 truck1)
   added: (at package14 s4)
   goals met: 10 of 20
39. (drive-truck truck1 s4 s8 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s8)
   changed: (driven) from 871 to 876
   goals met: 10 of 20
40. (board-truck driver5 truck3 s3)
   deleted: (at driver5 s3) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 9 of 20
41. (load-truck package9 truck3 s3)
   deleted: (at package9 s3)
   added: (in package9 truck3)
   goals met: 9 of 20
42. (load-truck package15 truck3 s3)
   deleted: (at package15 s3)
   added: (in package15 truck3)
   goals met: 9 of 20
43. (drive-truck truck1 s8 s7 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s7)
   changed: (driven) from 876 to 949
   goals met: 9 of 20
44. (drive-truck truck1 s7 s5 driver4)
   deleted: (at truck1 s7)
   added: (at truck1 s5)
   changed: (driven) from 949 to 992
   goals met: 9 of 20
45. (drive-truck truck3 s3 s6 driver5)
   deleted: (at truck3 s3)
   added: (at truck3 s6)
   changed: (driven) from 992 to 1036
   goals met: 9 of 20
46. (drive-truck truck3 s6 s1 driver5)
   deleted: (at truck3 s6)
   added: (at truck3 s1)
   changed: (driven) from 1036 to 1115
   goals met: 9 of 20
47. (unload-truck package15 truck3 s1)
   deleted: (in package15 truck3)
   added: (at package15 s1)
   goals met: 10 of 20
48. (drive-truck truck3 s1 s2 driver5)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (driven) from 1115 to 1123
   goals met: 10 of 20
49. (load-truck package3 truck3 s2)
   deleted: (at package3 s2)
   added: (in package3 truck3)
   goals met: 10 of 20
50. (drive-truck truck3 s2 s5 driver5)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   changed: (driven) from 1123 to 1177
   goals met: 10 of 20
51. (drive-truck truck3 s5 s4 driver5)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (driven) from 1177 to 1263
   goals met: 10 of 20
52. (unload-truck package3 truck3 s4)
   deleted: (in package3 truck3)
   added: (at package3 s4)
   goals met: 11 of 20
53. (drive-truck truck3 s4 s3 driver5)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   changed: (driven) from 1263 to 1338
   goals met: 11 of 20
54. (drive-truck truck3 s3 s0 driver5)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   changed: (driven) from 1338 to 1365
   goals met: 11 of 20
55. (drive-truck truck1 s5 s2 driver4)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   changed: (driven) from 1365 to 1419
   goals met: 11 of 20
56. (unload-truck package2 truck1 s2)
   deleted: (in package2 truck1)
   added: (at package2 s2)
   goals met: 12 of 20
57. (load-truck package4 truck1 s2)
   deleted: (at package4 s2)
   added: (in package4 truck1)
   goals met: 12 of 20
58. (unload-truck package10 truck1 s2)
   deleted: (in package10 truck1)
   added: (at package10 s2)
   goals met: 13 of 20
59. (load-truck package7 truck1 s2)
   deleted: (at package7 s2)
   added: (in package7 truck1)
   goals met: 13 of 20
60. (unload-truck package11 truck1 s2)
   deleted: (in package11 truck1)
   added: (at package11 s2)
   goals met: 14 of 20
61. (drive-truck truck1 s2 s8 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s8)
   changed: (driven) from 1419 to 1454
   goals met: 14 of 20
62. (drive-truck truck1 s8 s0 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s0)
   changed: (driven) from 1454 to 1487
   goals met: 15 of 20
63. (drive-truck truck1 s0 s3 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (driven) from 1487 to 1514
   goals met: 14 of 20
64. (unload-truck package4 truck1 s3)
   deleted: (in package4 truck1)
   added: (at package4 s3)
   goals met: 15 of 20
65. (unload-truck package7 truck1 s3)
   deleted: (in package7 truck1)
   added: (at package7 s3)
   goals met: 16 of 20
66. (drive-truck truck3 s0 s7 driver5)
   deleted: (at truck3 s0)
   added: (at truck3 s7)
   changed: (driven) from 1514 to 1564
   goals met: 16 of 20
67. (drive-truck truck1 s3 s0 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (driven) from 1564 to 1591
   goals met: 17 of 20
68. (drive-truck truck3 s7 s5 driver5)
   deleted: (at truck3 s7)
   added: (at truck3 s5)
   changed: (driven) from 1591 to 1634
   goals met: 17 of 20
69. (unload-truck package9 truck3 s5)
   deleted: (in package9 truck3)
   added: (at package9 s5)
   goals met: 18 of 20
70. (drive-truck truck3 s5 s7 driver5)
   deleted: (at truck3 s5)
   added: (at truck3 s7)
   changed: (driven) from 1634 to 1677
   goals met: 18 of 20
71. (drive-truck truck3 s7 s3 driver5)
   deleted: (at truck3 s7)
   added: (at truck3 s3)
   changed: (driven) from 1677 to 1703
   goals met: 18 of 20
72. (disembark-truck driver5 truck3 s3)
   deleted: (driving driver5 truck3)
   added: (at driver5 s3) (empty truck3)
   goals met: 19 of 20
73. (drive-truck truck1 s0 s8 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s8)
   changed: (driven) from 1703 to 1736
   goals met: 18 of 20
74. (drive-truck truck1 s8 s2 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s2)
   changed: (driven) from 1736 to 1771
   goals met: 18 of 20
75. (load-truck package8 truck1 s2)
   deleted: (at package8 s2)
   added: (in package8 truck1)
   goals met: 18 of 20
76. (drive-truck truck1 s2 s8 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s8)
   changed: (driven) from 1771 to 1806
   goals met: 18 of 20
77. (drive-truck truck1 s8 s7 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s7)
   changed: (driven) from 1806 to 1879
   goals met: 18 of 20
78. (unload-truck package8 truck1 s7)
   deleted: (in package8 truck1)
   added: (at package8 s7)
   goals met: 19 of 20
79. (drive-truck truck1 s7 s0 driver4)
   deleted: (at truck1 s7)
   added: (at truck1 s0)
   changed: (driven) from 1879 to 1929
   goals met: 20 of 20
